# Member1D

Representation of member1D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.member1_d import Member1D

# TODO update the JSON string below
json = "{}"
# create an instance of Member1D from a JSON string
member1_d_instance = Member1D.from_json(json)
# print the JSON string representation of the object
print(Member1D.to_json())

# convert the object into a dict
member1_d_dict = member1_d_instance.to_dict()
# create an instance of Member1D from a dict
member1_d_from_dict = Member1D.from_dict(member1_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)